MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2HG4E0AGV2000M/mcu.h
#define bFM_CAN1_STATR_TXOK                       *((volatile  uint8_t *)(0x42C6004CUL))
#define bFM4_CAN1_STATR_TXOK                      *((volatile  uint8_t *)(0x42C6004CUL))
#define bFM_CAN1_STATR_RXOK                       *((volatile  uint8_t *)(0x42C60050UL))
#define bFM4_CAN1_STATR_RXOK                      *((volatile  uint8_t *)(0x42C60050UL))
#define bFM_CAN1_STATR_EPASS                      *((volatile  uint8_t *)(0x42C60054UL))
#define bFM4_CAN1_STATR_EPASS                     *((volatile  uint8_t *)(0x42C60054UL))
#define bFM_CAN1_STATR_EWARN                      *((volatile  uint8_t *)(0x42C60058UL))
#define bFM4_CAN1_STATR_EWARN                     *((volatile  uint8_t *)(0x42C60058UL))
#define bFM_CAN1_STATR_BOFF                       *((volatile  uint8_t *)(0x42C6005CUL))
#define bFM4_CAN1_STATR_BOFF                      *((volatile  uint8_t *)(0x42C6005CUL))

#define bFM_CAN1_TESTR_BASIC                      *((volatile  uint8_t *)(0x42C60148UL))
#define bFM4_CAN1_TESTR_BASIC                     *((volatile  uint8_t *)(0x42C60148UL))
#define bFM_CAN1_TESTR_SILENT                     *((volatile  uint8_t *)(0x42C6014CUL))
#define bFM4_CAN1_TESTR_SILENT                    *((volatile  uint8_t *)(0x42C6014CUL))
#define bFM_CAN1_TESTR_LBACK                      *((volatile  uint8_t *)(0x42C60150UL))
#define bFM4_CAN1_TESTR_LBACK                     *((volatile  uint8_t *)(0x42C60150UL))
#define bFM_CAN1_TESTR_RX                         *((volatile  uint8_t *)(0x42C6015CUL))
#define bFM4_CAN1_TESTR_RX                        *((volatile  uint8_t *)(0x42C6015CUL))

#define bFM_CAN1_TREQR_TXRQST1                    *((volatile  uint8_t *)(0x42C61000UL))
#define bFM4_CAN1_TREQR_TXRQST1                   *((volatile  uint8_t *)(0x42C61000UL))
#define bFM_CAN1_TREQR_TXRQST2                    *((volatile  uint8_t *)(0x42C61004UL))
#define bFM4_CAN1_TREQR_TXRQST2                   *((volatile  uint8_t *)(0x42C61004UL))
#define bFM_CAN1_TREQR_TXRQST3                    *((volatile  uint8_t *)(0x42C61008UL))
#define bFM4_CAN1_TREQR_TXRQST3                   *((volatile  uint8_t *)(0x42C61008UL))
#define bFM_CAN1_TREQR_TXRQST4                    *((volatile  uint8_t *)(0x42C6100CUL))
#define bFM4_CAN1_TREQR_TXRQST4                   *((volatile  uint8_t *)(0x42C6100CUL))
#define bFM_CAN1_TREQR_TXRQST5                    *((volatile  uint8_t *)(0x42C61010UL))
#define bFM4_CAN1_TREQR_TXRQST5                   *((volatile  uint8_t *)(0x42C61010UL))
#define bFM_CAN1_TREQR_TXRQST6                    *((volatile  uint8_t *)(0x42C61014UL))
#define bFM4_CAN1_TREQR_TXRQST6                   *((volatile  uint8_t *)(0x42C61014UL))
#define bFM_CAN1_TREQR_TXRQST7                    *((volatile  uint8_t *)(0x42C61018UL))
#define bFM4_CAN1_TREQR_TXRQST7                   *((volatile  uint8_t *)(0x42C61018UL))
#define bFM_CAN1_TREQR_TXRQST8                    *((volatile  uint8_t *)(0x42C6101CUL))
#define bFM4_CAN1_TREQR_TXRQST8                   *((volatile  uint8_t *)(0x42C6101CUL))
#define bFM_CAN1_TREQR_TXRQST9                    *((volatile  uint8_t *)(0x42C61020UL))
#define bFM4_CAN1_TREQR_TXRQST9                   *((volatile  uint8_t *)(0x42C61020UL))
#define bFM_CAN1_TREQR_TXRQST10                   *((volatile  uint8_t *)(0x42C61024UL))
#define bFM4_CAN1_TREQR_TXRQST10                  *((volatile  uint8_t *)(0x42C61024UL))
#define bFM_CAN1_TREQR_TXRQST11                   *((volatile  uint8_t *)(0x42C61028UL))
#define bFM4_CAN1_TREQR_TXRQST11                  *((volatile  uint8_t *)(0x42C61028UL))
#define bFM_CAN1_TREQR_TXRQST12                   *((volatile  uint8_t *)(0x42C6102CUL))
#define bFM4_CAN1_TREQR_TXRQST12                  *((volatile  uint8_t *)(0x42C6102CUL))
#define bFM_CAN1_TREQR_TXRQST13                   *((volatile  uint8_t *)(0x42C61030UL))
#define bFM4_CAN1_TREQR_TXRQST13                  *((volatile  uint8_t *)(0x42C61030UL))
#define bFM_CAN1_TREQR_TXRQST14                   *((volatile  uint8_t *)(0x42C61034UL))
#define bFM4_CAN1_TREQR_TXRQST14                  *((volatile  uint8_t *)(0x42C61034UL))
#define bFM_CAN1_TREQR_TXRQST15                   *((volatile  uint8_t *)(0x42C61038UL))
#define bFM4_CAN1_TREQR_TXRQST15                  *((volatile  uint8_t *)(0x42C61038UL))
#define bFM_CAN1_TREQR_TXRQST16                   *((volatile  uint8_t *)(0x42C6103CUL))
#define bFM4_CAN1_TREQR_TXRQST16                  *((volatile  uint8_t *)(0x42C6103CUL))
#define bFM_CAN1_TREQR_TXRQST17                   *((volatile  uint8_t *)(0x42C61040UL))
#define bFM4_CAN1_TREQR_TXRQST17                  *((volatile  uint8_t *)(0x42C61040UL))
#define bFM_CAN1_TREQR_TXRQST18                   *((volatile  uint8_t *)(0x42C61044UL))
#define bFM4_CAN1_TREQR_TXRQST18                  *((volatile  uint8_t *)(0x42C61044UL))
#define bFM_CAN1_TREQR_TXRQST19                   *((volatile  uint8_t *)(0x42C61048UL))
#define bFM4_CAN1_TREQR_TXRQST19                  *((volatile  uint8_t *)(0x42C61048UL))
#define bFM_CAN1_TREQR_TXRQST20                   *((volatile  uint8_t *)(0x42C6104CUL))
#define bFM4_CAN1_TREQR_TXRQST20                  *((volatile  uint8_t *)(0x42C6104CUL))
#define bFM_CAN1_TREQR_TXRQST21                   *((volatile  uint8_t *)(0x42C61050UL))
#define bFM4_CAN1_TREQR_TXRQST21                  *((volatile  uint8_t *)(0x42C61050UL))
#define bFM_CAN1_TREQR_TXRQST22                   *((volatile  uint8_t *)(0x42C61054UL))
#define bFM4_CAN1_TREQR_TXRQST22                  *((volatile  uint8_t *)(0x42C61054UL))
#define bFM_CAN1_TREQR_TXRQST23                   *((volatile  uint8_t *)(0x42C61058UL))
#define bFM4_CAN1_TREQR_TXRQST23                  *((volatile  uint8_t *)(0x42C61058UL))
#define bFM_CAN1_TREQR_TXRQST24                   *((volatile  uint8_t *)(0x42C6105CUL))
#define bFM4_CAN1_TREQR_TXRQST24                  *((volatile  uint8_t *)(0x42C6105CUL))
#define bFM_CAN1_TREQR_TXRQST25                   *((volatile  uint8_t *)(0x42C61060UL))
#define bFM4_CAN1_TREQR_TXRQST25                  *((volatile  uint8_t *)(0x42C61060UL))
#define bFM_CAN1_TREQR_TXRQST26                   *((volatile  uint8_t *)(0x42C61064UL))
#define bFM4_CAN1_TREQR_TXRQST26                  *((volatile  uint8_t *)(0x42C61064UL))
#define bFM_CAN1_TREQR_TXRQST27                   *((volatile  uint8_t *)(0x42C61068UL))
#define bFM4_CAN1_TREQR_TXRQST27                  *((volatile  uint8_t *)(0x42C61068UL))
#define bFM_CAN1_TREQR_TXRQST28                   *((volatile  uint8_t *)(0x42C6106CUL))
#define bFM4_CAN1_TREQR_TXRQST28                  *((volatile  uint8_t *)(0x42C6106CUL))
#define bFM_CAN1_TREQR_TXRQST29                   *((volatile  uint8_t *)(0x42C61070UL))
#define bFM4_CAN1_TREQR_TXRQST29                  *((volatile  uint8_t *)(0x42C61070UL))
#define bFM_CAN1_TREQR_TXRQST30                   *((volatile  uint8_t *)(0x42C61074UL))
#define bFM4_CAN1_TREQR_TXRQST30                  *((volatile  uint8_t *)(0x42C61074UL))
#define bFM_CAN1_TREQR_TXRQST31                   *((volatile  uint8_t *)(0x42C61078UL))
#define bFM4_CAN1_TREQR_TXRQST31                  *((volatile  uint8_t *)(0x42C61078UL))
#define bFM_CAN1_TREQR_TXRQST32                   *((volatile  uint8_t *)(0x42C6107CUL))
#define bFM4_CAN1_TREQR_TXRQST32                  *((volatile  uint8_t *)(0x42C6107CUL))


