MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2HG4E0AGV2000M/mcu.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM4_EXTI_NMICL_NCL                       *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM4_EXTI_NMIRR_NR                        *((volatile  uint8_t *)(0x42600280UL))


/******************************************************************************
 ** FLASH_IF Registers FLASH_IF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_FLASH_IF_FBFCR_BE                     *((volatile  uint8_t *)(0x42000280UL))
#define bFM4_FLASH_IF_FBFCR_BE                    *((volatile  uint8_t *)(0x42000280UL))
#define bFM_FLASH_IF_FBFCR_BS                     *((volatile  uint8_t *)(0x42000284UL))
#define bFM4_FLASH_IF_FBFCR_BS                    *((volatile  uint8_t *)(0x42000284UL))

#define bFM_FLASH_IF_FICLR_RDYIC                  *((volatile  uint8_t *)(0x42000500UL))
#define bFM4_FLASH_IF_FICLR_RDYIC                 *((volatile  uint8_t *)(0x42000500UL))
#define bFM_FLASH_IF_FICLR_HNGIC                  *((volatile  uint8_t *)(0x42000504UL))
#define bFM4_FLASH_IF_FICLR_HNGIC                 *((volatile  uint8_t *)(0x42000504UL))
#define bFM_FLASH_IF_FICLR_ERRIC                  *((volatile  uint8_t *)(0x42000508UL))
#define bFM4_FLASH_IF_FICLR_ERRIC                 *((volatile  uint8_t *)(0x42000508UL))

#define bFM_FLASH_IF_FICR_RDYIE                   *((volatile  uint8_t *)(0x42000400UL))
#define bFM4_FLASH_IF_FICR_RDYIE                  *((volatile  uint8_t *)(0x42000400UL))
#define bFM_FLASH_IF_FICR_HNGIE                   *((volatile  uint8_t *)(0x42000404UL))
#define bFM4_FLASH_IF_FICR_HNGIE                  *((volatile  uint8_t *)(0x42000404UL))
#define bFM_FLASH_IF_FICR_ERRIE                   *((volatile  uint8_t *)(0x42000408UL))
#define bFM4_FLASH_IF_FICR_ERRIE                  *((volatile  uint8_t *)(0x42000408UL))

#define bFM_FLASH_IF_FISR_RDYIF                   *((volatile  uint8_t *)(0x42000480UL))
#define bFM4_FLASH_IF_FISR_RDYIF                  *((volatile  uint8_t *)(0x42000480UL))
#define bFM_FLASH_IF_FISR_HNGIF                   *((volatile  uint8_t *)(0x42000484UL))
#define bFM4_FLASH_IF_FISR_HNGIF                  *((volatile  uint8_t *)(0x42000484UL))
#define bFM_FLASH_IF_FISR_ERRIF                   *((volatile  uint8_t *)(0x42000488UL))
#define bFM4_FLASH_IF_FISR_ERRIF                  *((volatile  uint8_t *)(0x42000488UL))

#define bFM_FLASH_IF_FSTR_RDY                     *((volatile  uint8_t *)(0x42000100UL))
#define bFM4_FLASH_IF_FSTR_RDY                    *((volatile  uint8_t *)(0x42000100UL))
#define bFM_FLASH_IF_FSTR_HNG                     *((volatile  uint8_t *)(0x42000104UL))
#define bFM4_FLASH_IF_FSTR_HNG                    *((volatile  uint8_t *)(0x42000104UL))
#define bFM_FLASH_IF_FSTR_ERR                     *((volatile  uint8_t *)(0x42000108UL))
#define bFM4_FLASH_IF_FSTR_ERR                    *((volatile  uint8_t *)(0x42000108UL))


/******************************************************************************
 ** GPIO Registers GPIO
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_GPIO_ADE_AN00                         *((volatile  uint8_t *)(0x42DEA000UL))
#define bFM4_GPIO_ADE_AN00                        *((volatile  uint8_t *)(0x42DEA000UL))
#define bFM_GPIO_ADE_AN01                         *((volatile  uint8_t *)(0x42DEA004UL))
#define bFM4_GPIO_ADE_AN01                        *((volatile  uint8_t *)(0x42DEA004UL))
#define bFM_GPIO_ADE_AN02                         *((volatile  uint8_t *)(0x42DEA008UL))
#define bFM4_GPIO_ADE_AN02                        *((volatile  uint8_t *)(0x42DEA008UL))
#define bFM_GPIO_ADE_AN03                         *((volatile  uint8_t *)(0x42DEA00CUL))
#define bFM4_GPIO_ADE_AN03                        *((volatile  uint8_t *)(0x42DEA00CUL))
#define bFM_GPIO_ADE_AN04                         *((volatile  uint8_t *)(0x42DEA010UL))
#define bFM4_GPIO_ADE_AN04                        *((volatile  uint8_t *)(0x42DEA010UL))
#define bFM_GPIO_ADE_AN05                         *((volatile  uint8_t *)(0x42DEA014UL))
#define bFM4_GPIO_ADE_AN05                        *((volatile  uint8_t *)(0x42DEA014UL))
#define bFM_GPIO_ADE_AN06                         *((volatile  uint8_t *)(0x42DEA018UL))
#define bFM4_GPIO_ADE_AN06                        *((volatile  uint8_t *)(0x42DEA018UL))
#define bFM_GPIO_ADE_AN07                         *((volatile  uint8_t *)(0x42DEA01CUL))
#define bFM4_GPIO_ADE_AN07                        *((volatile  uint8_t *)(0x42DEA01CUL))
#define bFM_GPIO_ADE_AN08                         *((volatile  uint8_t *)(0x42DEA020UL))
#define bFM4_GPIO_ADE_AN08                        *((volatile  uint8_t *)(0x42DEA020UL))
#define bFM_GPIO_ADE_AN09                         *((volatile  uint8_t *)(0x42DEA024UL))
#define bFM4_GPIO_ADE_AN09                        *((volatile  uint8_t *)(0x42DEA024UL))
#define bFM_GPIO_ADE_AN10                         *((volatile  uint8_t *)(0x42DEA028UL))
#define bFM4_GPIO_ADE_AN10                        *((volatile  uint8_t *)(0x42DEA028UL))
#define bFM_GPIO_ADE_AN11                         *((volatile  uint8_t *)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN11                        *((volatile  uint8_t *)(0x42DEA02CUL))
#define bFM_GPIO_ADE_AN15                         *((volatile  uint8_t *)(0x42DEA03CUL))
#define bFM4_GPIO_ADE_AN15                        *((volatile  uint8_t *)(0x42DEA03CUL))
#define bFM_GPIO_ADE_AN16                         *((volatile  uint8_t *)(0x42DEA040UL))
#define bFM4_GPIO_ADE_AN16                        *((volatile  uint8_t *)(0x42DEA040UL))
#define bFM_GPIO_ADE_AN17                         *((volatile  uint8_t *)(0x42DEA044UL))
#define bFM4_GPIO_ADE_AN17                        *((volatile  uint8_t *)(0x42DEA044UL))
#define bFM_GPIO_ADE_AN19                         *((volatile  uint8_t *)(0x42DEA04CUL))
#define bFM4_GPIO_ADE_AN19                        *((volatile  uint8_t *)(0x42DEA04CUL))

