MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2HG4E0AGV2000M/mcu.h
#define bFM_MFT2_ADCMP_ACMC5_MZCE                 *((volatile  uint8_t *)(0x42443D58UL))
#define bFM4_MFT2_ADCMP_ACMC5_MZCE                *((volatile  uint8_t *)(0x42443D58UL))
#define bFM_MFT2_ADCMP_ACMC5_MPCE                 *((volatile  uint8_t *)(0x42443D5CUL))
#define bFM4_MFT2_ADCMP_ACMC5_MPCE                *((volatile  uint8_t *)(0x42443D5CUL))

#define bFM_MFT2_ADCMP_ACSC0_APBM                 *((volatile  uint8_t *)(0x42443A94UL))
#define bFM4_MFT2_ADCMP_ACSC0_APBM                *((volatile  uint8_t *)(0x42443A94UL))

#define bFM_MFT2_ADCMP_ACSC1_APBM                 *((volatile  uint8_t *)(0x42443B14UL))
#define bFM4_MFT2_ADCMP_ACSC1_APBM                *((volatile  uint8_t *)(0x42443B14UL))

#define bFM_MFT2_ADCMP_ACSC2_APBM                 *((volatile  uint8_t *)(0x42443B94UL))
#define bFM4_MFT2_ADCMP_ACSC2_APBM                *((volatile  uint8_t *)(0x42443B94UL))

#define bFM_MFT2_ADCMP_ACSC3_APBM                 *((volatile  uint8_t *)(0x42443C14UL))
#define bFM4_MFT2_ADCMP_ACSC3_APBM                *((volatile  uint8_t *)(0x42443C14UL))

#define bFM_MFT2_ADCMP_ACSC4_APBM                 *((volatile  uint8_t *)(0x42443C94UL))
#define bFM4_MFT2_ADCMP_ACSC4_APBM                *((volatile  uint8_t *)(0x42443C94UL))

#define bFM_MFT2_ADCMP_ACSC5_APBM                 *((volatile  uint8_t *)(0x42443D14UL))
#define bFM4_MFT2_ADCMP_ACSC5_APBM                *((volatile  uint8_t *)(0x42443D14UL))

#define bFM_MFT2_ADCMP_ACSD0_AMOD                 *((volatile  uint8_t *)(0x42443AA0UL))
#define bFM4_MFT2_ADCMP_ACSD0_AMOD                *((volatile  uint8_t *)(0x42443AA0UL))
#define bFM_MFT2_ADCMP_ACSD0_OCUS                 *((volatile  uint8_t *)(0x42443AA4UL))
#define bFM4_MFT2_ADCMP_ACSD0_OCUS                *((volatile  uint8_t *)(0x42443AA4UL))
#define bFM_MFT2_ADCMP_ACSD0_DE                   *((volatile  uint8_t *)(0x42443AB0UL))
#define bFM4_MFT2_ADCMP_ACSD0_DE                  *((volatile  uint8_t *)(0x42443AB0UL))
#define bFM_MFT2_ADCMP_ACSD0_PE                   *((volatile  uint8_t *)(0x42443AB4UL))
#define bFM4_MFT2_ADCMP_ACSD0_PE                  *((volatile  uint8_t *)(0x42443AB4UL))
#define bFM_MFT2_ADCMP_ACSD0_UE                   *((volatile  uint8_t *)(0x42443AB8UL))
#define bFM4_MFT2_ADCMP_ACSD0_UE                  *((volatile  uint8_t *)(0x42443AB8UL))
#define bFM_MFT2_ADCMP_ACSD0_ZE                   *((volatile  uint8_t *)(0x42443ABCUL))
#define bFM4_MFT2_ADCMP_ACSD0_ZE                  *((volatile  uint8_t *)(0x42443ABCUL))

#define bFM_MFT2_ADCMP_ACSD1_AMOD                 *((volatile  uint8_t *)(0x42443B20UL))
#define bFM4_MFT2_ADCMP_ACSD1_AMOD                *((volatile  uint8_t *)(0x42443B20UL))
#define bFM_MFT2_ADCMP_ACSD1_OCUS                 *((volatile  uint8_t *)(0x42443B24UL))
#define bFM4_MFT2_ADCMP_ACSD1_OCUS                *((volatile  uint8_t *)(0x42443B24UL))
#define bFM_MFT2_ADCMP_ACSD1_DE                   *((volatile  uint8_t *)(0x42443B30UL))
#define bFM4_MFT2_ADCMP_ACSD1_DE                  *((volatile  uint8_t *)(0x42443B30UL))
#define bFM_MFT2_ADCMP_ACSD1_PE                   *((volatile  uint8_t *)(0x42443B34UL))
#define bFM4_MFT2_ADCMP_ACSD1_PE                  *((volatile  uint8_t *)(0x42443B34UL))
#define bFM_MFT2_ADCMP_ACSD1_UE                   *((volatile  uint8_t *)(0x42443B38UL))
#define bFM4_MFT2_ADCMP_ACSD1_UE                  *((volatile  uint8_t *)(0x42443B38UL))
#define bFM_MFT2_ADCMP_ACSD1_ZE                   *((volatile  uint8_t *)(0x42443B3CUL))
#define bFM4_MFT2_ADCMP_ACSD1_ZE                  *((volatile  uint8_t *)(0x42443B3CUL))

#define bFM_MFT2_ADCMP_ACSD2_AMOD                 *((volatile  uint8_t *)(0x42443BA0UL))
#define bFM4_MFT2_ADCMP_ACSD2_AMOD                *((volatile  uint8_t *)(0x42443BA0UL))
#define bFM_MFT2_ADCMP_ACSD2_OCUS                 *((volatile  uint8_t *)(0x42443BA4UL))
#define bFM4_MFT2_ADCMP_ACSD2_OCUS                *((volatile  uint8_t *)(0x42443BA4UL))
#define bFM_MFT2_ADCMP_ACSD2_DE                   *((volatile  uint8_t *)(0x42443BB0UL))
#define bFM4_MFT2_ADCMP_ACSD2_DE                  *((volatile  uint8_t *)(0x42443BB0UL))
#define bFM_MFT2_ADCMP_ACSD2_PE                   *((volatile  uint8_t *)(0x42443BB4UL))
#define bFM4_MFT2_ADCMP_ACSD2_PE                  *((volatile  uint8_t *)(0x42443BB4UL))
#define bFM_MFT2_ADCMP_ACSD2_UE                   *((volatile  uint8_t *)(0x42443BB8UL))
#define bFM4_MFT2_ADCMP_ACSD2_UE                  *((volatile  uint8_t *)(0x42443BB8UL))
#define bFM_MFT2_ADCMP_ACSD2_ZE                   *((volatile  uint8_t *)(0x42443BBCUL))
#define bFM4_MFT2_ADCMP_ACSD2_ZE                  *((volatile  uint8_t *)(0x42443BBCUL))

#define bFM_MFT2_ADCMP_ACSD3_AMOD                 *((volatile  uint8_t *)(0x42443C20UL))
#define bFM4_MFT2_ADCMP_ACSD3_AMOD                *((volatile  uint8_t *)(0x42443C20UL))
#define bFM_MFT2_ADCMP_ACSD3_OCUS                 *((volatile  uint8_t *)(0x42443C24UL))
#define bFM4_MFT2_ADCMP_ACSD3_OCUS                *((volatile  uint8_t *)(0x42443C24UL))
#define bFM_MFT2_ADCMP_ACSD3_DE                   *((volatile  uint8_t *)(0x42443C30UL))
#define bFM4_MFT2_ADCMP_ACSD3_DE                  *((volatile  uint8_t *)(0x42443C30UL))
#define bFM_MFT2_ADCMP_ACSD3_PE                   *((volatile  uint8_t *)(0x42443C34UL))
#define bFM4_MFT2_ADCMP_ACSD3_PE                  *((volatile  uint8_t *)(0x42443C34UL))
#define bFM_MFT2_ADCMP_ACSD3_UE                   *((volatile  uint8_t *)(0x42443C38UL))
#define bFM4_MFT2_ADCMP_ACSD3_UE                  *((volatile  uint8_t *)(0x42443C38UL))
#define bFM_MFT2_ADCMP_ACSD3_ZE                   *((volatile  uint8_t *)(0x42443C3CUL))
#define bFM4_MFT2_ADCMP_ACSD3_ZE                  *((volatile  uint8_t *)(0x42443C3CUL))

#define bFM_MFT2_ADCMP_ACSD4_AMOD                 *((volatile  uint8_t *)(0x42443CA0UL))
#define bFM4_MFT2_ADCMP_ACSD4_AMOD                *((volatile  uint8_t *)(0x42443CA0UL))
#define bFM_MFT2_ADCMP_ACSD4_OCUS                 *((volatile  uint8_t *)(0x42443CA4UL))
#define bFM4_MFT2_ADCMP_ACSD4_OCUS                *((volatile  uint8_t *)(0x42443CA4UL))
#define bFM_MFT2_ADCMP_ACSD4_DE                   *((volatile  uint8_t *)(0x42443CB0UL))
#define bFM4_MFT2_ADCMP_ACSD4_DE                  *((volatile  uint8_t *)(0x42443CB0UL))
#define bFM_MFT2_ADCMP_ACSD4_PE                   *((volatile  uint8_t *)(0x42443CB4UL))
#define bFM4_MFT2_ADCMP_ACSD4_PE                  *((volatile  uint8_t *)(0x42443CB4UL))
#define bFM_MFT2_ADCMP_ACSD4_UE                   *((volatile  uint8_t *)(0x42443CB8UL))
#define bFM4_MFT2_ADCMP_ACSD4_UE                  *((volatile  uint8_t *)(0x42443CB8UL))
#define bFM_MFT2_ADCMP_ACSD4_ZE                   *((volatile  uint8_t *)(0x42443CBCUL))
#define bFM4_MFT2_ADCMP_ACSD4_ZE                  *((volatile  uint8_t *)(0x42443CBCUL))

