MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2HG4E0AGV2000M/mcu.h
#define bFM_SDIF_SPRVAL6_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0DA8UL))
#define bFM4_SDIF_SPRVAL6_CGSELVAL                *((volatile  uint8_t *)(0x42DC0DA8UL))

#define bFM_SDIF_SPRVAL7_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0DE8UL))
#define bFM4_SDIF_SPRVAL7_CGSELVAL                *((volatile  uint8_t *)(0x42DC0DE8UL))

#define bFM_SDIF_SPWRCTL_SDBUSPWR                 *((volatile  uint8_t *)(0x42DC0520UL))
#define bFM4_SDIF_SPWRCTL_SDBUSPWR                *((volatile  uint8_t *)(0x42DC0520UL))

#define bFM_SDIF_SPWSWCL_ATPWRSWEN                *((volatile  uint8_t *)(0x42DC2080UL))
#define bFM4_SDIF_SPWSWCL_ATPWRSWEN               *((volatile  uint8_t *)(0x42DC2080UL))
#define bFM_SDIF_SPWSWCL_IOREGSEL                 *((volatile  uint8_t *)(0x42DC2084UL))
#define bFM4_SDIF_SPWSWCL_IOREGSEL                *((volatile  uint8_t *)(0x42DC2084UL))

#define bFM_SDIF_SSRST_SWRSTALL                   *((volatile  uint8_t *)(0x42DC05E0UL))
#define bFM4_SDIF_SSRST_SWRSTALL                  *((volatile  uint8_t *)(0x42DC05E0UL))
#define bFM_SDIF_SSRST_SWRSTCMDLN                 *((volatile  uint8_t *)(0x42DC05E4UL))
#define bFM4_SDIF_SSRST_SWRSTCMDLN                *((volatile  uint8_t *)(0x42DC05E4UL))
#define bFM_SDIF_SSRST_SWRSTDATLN                 *((volatile  uint8_t *)(0x42DC05E8UL))
#define bFM4_SDIF_SSRST_SWRSTDATLN                *((volatile  uint8_t *)(0x42DC05E8UL))

#define bFM_SDIF_STRSFMD_DMAEN                    *((volatile  uint8_t *)(0x42DC0180UL))
#define bFM4_SDIF_STRSFMD_DMAEN                   *((volatile  uint8_t *)(0x42DC0180UL))
#define bFM_SDIF_STRSFMD_BLCKCNTEN                *((volatile  uint8_t *)(0x42DC0184UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTEN               *((volatile  uint8_t *)(0x42DC0184UL))
#define bFM_SDIF_STRSFMD_DTTRSFDIR                *((volatile  uint8_t *)(0x42DC0190UL))
#define bFM4_SDIF_STRSFMD_DTTRSFDIR               *((volatile  uint8_t *)(0x42DC0190UL))
#define bFM_SDIF_STRSFMD_BLCKCNTSEL               *((volatile  uint8_t *)(0x42DC0194UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTSEL              *((volatile  uint8_t *)(0x42DC0194UL))

#define bFM_SDIF_STUNSETH_CMDCFCHKDS              *((volatile  uint8_t *)(0x42DC2140UL))
#define bFM4_SDIF_STUNSETH_CMDCFCHKDS             *((volatile  uint8_t *)(0x42DC2140UL))

#define bFM_SDIF_STUNSETL_TNPHSELEN               *((volatile  uint8_t *)(0x42DC2120UL))
#define bFM4_SDIF_STUNSETL_TNPHSELEN              *((volatile  uint8_t *)(0x42DC2120UL))
#define bFM_SDIF_STUNSETL_TNERRBDSEL              *((volatile  uint8_t *)(0x42DC2124UL))
#define bFM4_SDIF_STUNSETL_TNERRBDSEL             *((volatile  uint8_t *)(0x42DC2124UL))
#define bFM_SDIF_STUNSETL_RETNTAPSEL              *((volatile  uint8_t *)(0x42DC2128UL))
#define bFM4_SDIF_STUNSETL_RETNTAPSEL             *((volatile  uint8_t *)(0x42DC2128UL))

#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN0             *((volatile  uint8_t *)(0x42DC0560UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN0            *((volatile  uint8_t *)(0x42DC0560UL))
#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN1             *((volatile  uint8_t *)(0x42DC0564UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN1            *((volatile  uint8_t *)(0x42DC0564UL))
#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN2             *((volatile  uint8_t *)(0x42DC0568UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN2            *((volatile  uint8_t *)(0x42DC0568UL))


/******************************************************************************
 ** SWWDT Registers SWWDT
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_SWWDT_WDOGCONTROL_INTEN               *((volatile  uint32_t*)(0x42240100UL))
#define bFM4_SWWDT_WDOGCONTROL_INTEN              *((volatile  uint32_t*)(0x42240100UL))
#define bFM_SWWDT_WDOGCONTROL_RESEN               *((volatile  uint32_t*)(0x42240104UL))
#define bFM4_SWWDT_WDOGCONTROL_RESEN              *((volatile  uint32_t*)(0x42240104UL))
#define bFM_SWWDT_WDOGCONTROL_SPM                 *((volatile  uint32_t*)(0x42240110UL))
#define bFM4_SWWDT_WDOGCONTROL_SPM                *((volatile  uint32_t*)(0x42240110UL))

#define bFM_SWWDT_WDOGRIS_RIS                     *((volatile  uint32_t*)(0x42240200UL))
#define bFM4_SWWDT_WDOGRIS_RIS                    *((volatile  uint32_t*)(0x42240200UL))

#define bFM_SWWDT_WDOGSPMC_TGR                    *((volatile  uint32_t*)(0x42240300UL))
#define bFM4_SWWDT_WDOGSPMC_TGR                   *((volatile  uint32_t*)(0x42240300UL))


/******************************************************************************
 ** UNIQUE_ID Registers UNIQUE_ID
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** WC Registers WC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_WC_CLK_EN_CLK_EN                      *((volatile  uint8_t *)(0x42740280UL))
#define bFM4_WC_CLK_EN_CLK_EN                     *((volatile  uint8_t *)(0x42740280UL))
#define bFM_WC_CLK_EN_CLK_EN_R                    *((volatile  uint8_t *)(0x42740284UL))
#define bFM4_WC_CLK_EN_CLK_EN_R                   *((volatile  uint8_t *)(0x42740284UL))

#define bFM_WC_WCCR_WCIF                          *((volatile  uint8_t *)(0x42740040UL))
#define bFM4_WC_WCCR_WCIF                         *((volatile  uint8_t *)(0x42740040UL))
#define bFM_WC_WCCR_WCIE                          *((volatile  uint8_t *)(0x42740044UL))
#define bFM4_WC_WCCR_WCIE                         *((volatile  uint8_t *)(0x42740044UL))
#define bFM_WC_WCCR_WCOP                          *((volatile  uint8_t *)(0x42740058UL))
#define bFM4_WC_WCCR_WCOP                         *((volatile  uint8_t *)(0x42740058UL))
#define bFM_WC_WCCR_WCEN                          *((volatile  uint8_t *)(0x4274005CUL))
#define bFM4_WC_WCCR_WCEN                         *((volatile  uint8_t *)(0x4274005CUL))


/******************************************************************************
 ** WORKFLASH_IF Registers WORKFLASH_IF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_WORKFLASH_IF_WFASZR_ASZ               *((volatile  uint8_t *)(0x23C00000UL))
#define bFM4_WORKFLASH_IF_WFASZR_ASZ              *((volatile  uint8_t *)(0x23C00000UL))

#define bFM_WORKFLASH_IF_WFSTR_RDY                *((volatile  uint8_t *)(0x23C00100UL))
#define bFM4_WORKFLASH_IF_WFSTR_RDY               *((volatile  uint8_t *)(0x23C00100UL))
#define bFM_WORKFLASH_IF_WFSTR_HNG                *((volatile  uint8_t *)(0x23C00104UL))
#define bFM4_WORKFLASH_IF_WFSTR_HNG               *((volatile  uint8_t *)(0x23C00104UL))


#if defined __cplusplus
}
#endif

#endif /* _S6E2HGXE_H_ */
